app/Controllers/History.php

SELECT *
FROM `tbl_identitas`
WHERE `id_user` = '1'
 LIMIT 1
SELECT *
FROM `tbl_transaksi`
WHERE `id_identitas` = '2'
AND `tgl_booking_lapangan` = '2022-06-17'
AND `booking_status` = 1
ORDER BY `booking_status` ASC
SELECT *
FROM `tbl_transaksi`
WHERE `id_identitas` = '2'
AND `booking_status` = 1
---
    public function index()
    {
      if(session()->get('level') == 1)
        {
            $Identitas = new IdentitasModel();
            $Transaksi = new TransaksiModel();
            $Histori = new HistoriModel();

            $id_user    = session()->get('ID');

            $dataidentitas = $Identitas->where([
                                        'id_user' => $id_user,
                                    ])->first();

            $tgl = date("Y-m-d");


            $dataTransaksi = $Transaksi->where([
                                        'id_identitas' => $dataidentitas->id_identitas,
                                        'tgl_booking_lapangan' => $tgl,
                                        'booking_status' => 1,
                                    ])->orderBy('booking_status', 'ASC')->findAll();

            $dataTransaksi2 = $Transaksi->where([
                                        'id_identitas' => $dataidentitas->id_identitas,
                                        'booking_status' => 1,
                                    ])->findAll();

SELECT *
FROM `tbl_identitas`
WHERE `id_users` = '1'
 LIMIT 1
SELECT *
FROM `tbl_histori`
WHERE `id_identitas` = '1'
AND `tgl_booking_lapangan` = '2022-05-01'
---
    public function view_all()
    {
        if(session()->get('level') == 1)
        {
            $Identitas = new IdentitasModel();
            $Histori = new HistoriModel();

            $id_user    = session()->get('ID');
            $dataidentitas = $Identitas->where([
                                        'id_user' => $id_user,
                                    ])->first();


            $tglview = $this->request->getVar('tglallv');
            if (isset($tglview)) {
                $tgl2 = $tglview;
                $pecah_tgl_book = explode('-', $tglview);
                $tahunedit      = explode(' ', $pecah_tgl_book[2]);
                $tgl   = $tahunedit[0].'-'.$pecah_tgl_book[1].'-'.$pecah_tgl_book[0];
            }else{
                $tgl = date("Y-m-d");
                $tgl2 = date('d-m-Y');

            }

            $dataHistori = $Histori->where([
                                    'id_identitas' => $dataidentitas->id_identitas,
                                    'tgl_booking_lapangan' => $tgl,
                                ])->findAll();

SELECT *
FROM `tbl_identitas`
WHERE `id_user` = '1'
 LIMIT 1
SELECT *
FROM `tbl_histori`
WHERE `id_histori` = '2'
SELECT *
FROM `tbl_transaksi`
WHERE `kode_transaksi` = 'FUT0414222226'
AND `id_identitas` = '1'
UPDATE `tbl_transaksi` SET `booking_status` = 9
WHERE `tbl_transaksi`.`id_transaksi` IN ('5')
UPDATE `tbl_histori` SET `booking_status` = 9
WHERE `tbl_histori`.`id_histori` IN ('2')
---
    public function view_all_cancel()
    {
            $Identitas = new IdentitasModel();
            $Histori = new HistoriModel();
            $Transaksi = new TransaksiModel();

            $id_history = $this->request->getVar('history_one');


            $id_user    = session()->get('ID');

            $dataidentitas = $Identitas->where([
                                        'id_user' => $id_user,
                                    ])->first();

            $dataHistori = $Histori->where([
                                            'id_histori ' => $id_history ,
                                        ])->findAll();

            foreach ($dataHistori as $v_dataHistori) {
                    $datatransaksi = $Transaksi->where([
                                            'kode_transaksi' => $v_dataHistori->kode_transaksi,
                                            'id_identitas' => $dataidentitas->id_identitas,
                                        ])->findAll();
                    foreach ($datatransaksi as $v_datatransaksi) {
                      $Transaksi->update($v_datatransaksi->id_transaksi, ['booking_status' => 9]);
                    }
            }

            $Histori->update($id_history, ['booking_status' => 9]);