app/Controllers/Home.php

    public function index()
    {
            /*
            'username' => $dataUser->username_users,
                                'ID' => $dataUser->id_users ,
                                'level' => $dataUser->level_users,
                                'logged_in' => TRUE
            */

        $Harga      = new HargaModel();
        $Identitas  = new IdentitasModel();
        $Transaksi  = new TransaksiModel();




        /* data lv1 (user)  */
        $dataHarga      = $Harga->findAll();
        $dataIdentitas  = $Identitas->findAll();

        $dataTransaksi = $Transaksi->where([
                                        'tgl_booking_lapangan' => date("Y-m-d"),
                                    ])->findAll();
---
SELECT *
FROM `tbl_harga`
SELECT *
FROM `tbl_identitas`
SELECT *
FROM `tbl_transaksi`
WHERE `tgl_booking_lapangan` = '2022-04-23'