app/Controllers/Pegawai.php

SELECT *
FROM `tbl_identitas`
WHERE `id_users` = '1'
---
    public function index()
    {
        if((session()->get('level') == 2)||(session()->get('level') == 3)) {


            $Identitas = new IdentitasModel();
            $Provinsis = new ProvinsiModel();

            $dataIdentitas = $Identitas->joinAll();

            $id_user = session()->get('ID');
            $getdatauserall = $Identitas->where([
                                            'id_users' => $id_user,
                                        ])->findAll();