app/Controllers/Pelanggan.php

UPDATE `tbl_user` SET `username_users` = 'admin1', `level_users` = 1
WHERE `tbl_user`.`id_users` IN ('4')
UPDATE `tbl_identitas` SET `gambar` = '1651284624_1ae49b024a94ed2730c7.png', `id_users` = '4', `firstname` = 'Muhammad1', `lastname` = 'Fhauzan1', `email` = 'ojan1990@gmail.com1', `hp` = '11-111-111-111', `tim` = '111111111', `alamat` = '111111111111', `provinsi_id` = '51', `kabupaten_id` = '5101', `kecamatan_id` = '5101010', `desa_id` = '5101010005'
WHERE `tbl_identitas`.`id_identitas` IN ('24')
---



                $Users->update($id_users, $dataUsersup);
                $Identitas->update($dataIdentitas[0]->id_identitas, $dataIdentitasup);