app/Controllers/Transaksi.php

    public function index()
    {
        if((session()->get('level') == 1)||(session()->get('level') == 2))
        {
            $Identitas = new IdentitasModel();
            $id_user    = session()->get('ID');

            $dataidentitas = $Identitas->where([
                                        'id_user' => $id_user,
                                    ])->first();
---
SELECT *
FROM `tbl_identitas`
WHERE `id_users` = '3'
 LIMIT 1

    public function trs_booking($getdata = null)
    {
        if(session()->get('level') == 2)
        {

            $Histori = new HistoriModel();

            if (isset($getdata)) {
                $pecahtgl = explode("-",$getdata);
                $tgl = $pecahtgl[2].'-'.$pecahtgl[1].'-'.$pecahtgl[0];
            }else{
                $tgl = date("Y-m-d");
            }

            $dataHistori = $Histori->where([
                                        'tgl_booking_lapangan' => $tgl,
                                    ])->findAll();
---
SELECT *
FROM `tbl_histori`
WHERE `tgl_booking_lapangan` = '2022-05-01'

    public function trs_pembayaran($getdata = null)
    {
        if(session()->get('level') == 2)
        {
            if (isset($getdata)) {
                $pecahtgl = explode("-",$getdata);
                $tgl = $pecahtgl[2].'-'.$pecahtgl[1].'-'.$pecahtgl[0];
            }else{
                $tgl = date("Y-m-d");
            }

            $Histori = new HistoriModel();
            $Transaksi = new TransaksiModel();

            $dataHistori = $Histori->join_where($tgl);
            $dataHistori2 = $Histori->findAll();
---
SELECT *
FROM `tbl_histori`