app/Models/HistoriModel.php

SELECT *
FROM `tbl_histori`
WHERE `booking_status` = 1
OR `booking_status` = 2
ORDER BY `id_histori` DESC
 LIMIT 5
---
    function limit_histori()
    {
        $builder = $this->db->table('tbl_histori');
        $builder->limit(5);
        $builder->where('booking_status', 1);
        $builder->orWhere('booking_status', 2);
        $builder->orderBy('id_histori', 'DESC');

        $query = $builder->get();

SELECT *
FROM `tbl_histori`
JOIN `tbl_identitas` ON `tbl_identitas`.`id_identitas`  = `tbl_histori`.`id_identitas`
WHERE `tgl_booking_lapangan` = '2022-04-27'
ORDER BY `id_histori` DESC
---
    function join_where($a = null)
    {
        $builder = $this->db->table('tbl_histori');
        $builder->join('tbl_identitas', 'tbl_identitas.id_identitas  = tbl_histori.id_identitas');
        $builder->where('tgl_booking_lapangan', $a);
        $builder->orderBy('id_histori', 'DESC');
        $query = $builder->get();