app/Models/IdentitasModel.php

    function joinAll()
    {
        $builder = $this->db->table('tbl_identitas');
        $builder->join('tbl_user', 'tbl_user.id_users = tbl_identitas.id_users');
        $builder->join('wilayah_provinsi', 'wilayah_provinsi.id = tbl_identitas.provinsi_id');
        $builder->join('wilayah_kabupaten', 'wilayah_kabupaten.id = tbl_identitas.kabupaten_id');
        $builder->join('wilayah_kecamatan', 'wilayah_kecamatan.id = tbl_identitas.kecamatan_id');
        $builder->join('wilayah_desa', 'wilayah_desa.id = tbl_identitas.desa_id');
        $query = $builder->get();
---
SELECT *
FROM `tbl_identitas`
JOIN `tbl_user` ON `tbl_user`.`id_users` = `tbl_identitas`.`id_users`
JOIN `wilayah_provinsi` ON `wilayah_provinsi`.`id` = `tbl_identitas`.`provinsi_id`
JOIN `wilayah_kabupaten` ON `wilayah_kabupaten`.`id` = `tbl_identitas`.`kabupaten_id`
JOIN `wilayah_kecamatan` ON `wilayah_kecamatan`.`id` = `tbl_identitas`.`kecamatan_id`
JOIN `wilayah_desa` ON `wilayah_desa`.`id` = `tbl_identitas`.`desa_id`

    function join_where($a = null)
    {
        $builder = $this->db->table('tbl_identitas');
        $builder->join('tbl_user', 'tbl_user.id_users = tbl_identitas.id_users');
        $builder->join('wilayah_provinsi', 'wilayah_provinsi.id = tbl_identitas.provinsi_id');
        $builder->join('wilayah_kabupaten', 'wilayah_kabupaten.id = tbl_identitas.kabupaten_id');
        $builder->join('wilayah_kecamatan', 'wilayah_kecamatan.id = tbl_identitas.kecamatan_id');
        $builder->join('wilayah_desa', 'wilayah_desa.id = tbl_identitas.desa_id');
        $builder->where('id_identitas ', $a);

        $query = $builder->get();
---
SELECT *
FROM `tbl_identitas`
JOIN `tbl_user` ON `tbl_user`.`id_users` = `tbl_identitas`.`id_users`
JOIN `wilayah_provinsi` ON `wilayah_provinsi`.`id` = `tbl_identitas`.`provinsi_id`
JOIN `wilayah_kabupaten` ON `wilayah_kabupaten`.`id` = `tbl_identitas`.`kabupaten_id`
JOIN `wilayah_kecamatan` ON `wilayah_kecamatan`.`id` = `tbl_identitas`.`kecamatan_id`
JOIN `wilayah_desa` ON `wilayah_desa`.`id` = `tbl_identitas`.`desa_id`
WHERE `id_identitas` = '2'

    function join_profil_a($a = null)
    {
        $builder = $this->db->table('tbl_identitas');
        $builder->join('tbl_user', 'tbl_user.id_users = tbl_identitas.id_users');
        $builder->join('wilayah_provinsi', 'wilayah_provinsi.id = tbl_identitas.provinsi_id');
        $builder->join('wilayah_kabupaten', 'wilayah_kabupaten.id = tbl_identitas.kabupaten_id');
        $builder->join('wilayah_kecamatan', 'wilayah_kecamatan.id = tbl_identitas.kecamatan_id');
        $builder->join('wilayah_desa', 'wilayah_desa.id = tbl_identitas.desa_id');

        $builder->where('tbl_identitas.id_users', $a);
        $query = $builder->get();
---
SELECT *
FROM `tbl_identitas`
JOIN `tbl_user` ON `tbl_user`.`id_users` = `tbl_identitas`.`id_users`
JOIN `wilayah_provinsi` ON `wilayah_provinsi`.`id` = `tbl_identitas`.`provinsi_id`
JOIN `wilayah_kabupaten` ON `wilayah_kabupaten`.`id` = `tbl_identitas`.`kabupaten_id`
JOIN `wilayah_kecamatan` ON `wilayah_kecamatan`.`id` = `tbl_identitas`.`kecamatan_id`
JOIN `wilayah_desa` ON `wilayah_desa`.`id` = `tbl_identitas`.`desa_id`
WHERE `tbl_identitas`.`id_users` = '2'