app/Models/TransaksiModel.php

     function where3($a = null, $b = null, $c = null)
    {
        $builder = $this->db->table('tbl_transaksi');
        //$builder->selectCount($count);
        $builder->where('tgl_booking_lapangan', $a);
        $builder->where('booking_lapangan', $b);
        $builder->where('booking_start', $c);
        $query = $builder->get();
---
SELECT *
FROM `tbl_transaksi`
WHERE `tgl_booking_lapangan` = '2022-04-22'
AND `booking_lapangan` = '1'
AND `booking_start` = '8:00'

     function join_where($a = null, $b = null)
    {
        $builder = $this->db->table('tbl_transaksi');
        $builder->join('tbl_identitas', 'tbl_identitas.id_identitas  = tbl_transaksi.id_identitas');

        $builder->where('tgl_booking_lapangan', $a);
        $builder->where('booking_lapangan', $b);
        $query = $builder->get();
---
SELECT *
FROM `tbl_transaksi`
JOIN `tbl_identitas` ON `tbl_identitas`.`id_identitas`  = `tbl_transaksi`.`id_identitas`
WHERE `tgl_booking_lapangan` = '2022-05-01'
AND `booking_lapangan` = 1

    function join_spc_jadwal($a = null)
    {
        $builder = $this->db->table('tbl_transaksi');
        $builder->join('tbl_identitas', 'tbl_identitas.id_identitas  = tbl_transaksi.id_identitas');

        $builder->where('id_transaksi', $a);
        $query = $builder->get();
---
SELECT *
FROM `tbl_transaksi`
JOIN `tbl_identitas` ON `tbl_identitas`.`id_identitas`  = `tbl_transaksi`.`id_identitas`
WHERE `id_transaksi` = '17'